app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "user_id", "visits_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "NUevo Articulo"], ["body", "Articulo con 0 visitas"], ["user_id", 1], ["visits_count", 0], ["created_at", "2017-10-19 15:32:28.009083"], ["updated_at", "2017-10-19 15:32:28.009083"]]
---
	def create
		@article = current_user.articles.new(article_params)
		if @article.save

UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "Articulo Editado"], ["updated_at", "2017-10-19 14:49:28.101636"], ["id", 1]]
---
	def update
		if @article.update(article_params)