app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "ESte es otro comentario"], ["user_id", 1], ["article_id", 3], ["created_at", "2017-10-20 15:34:03.178333"], ["updated_at", "2017-10-20 15:34:03.178333"]]
---
  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article
    respond_to do |format|
      if @comment.save